---
kind: property
id: P:Autodesk.Revit.DB.Architecture.PostPattern.CornerPostAngle
source: html/29aab256-a573-fd29-be2e-7e0cbaa96164.htm
---
# Autodesk.Revit.DB.Architecture.PostPattern.CornerPostAngle Property

The angle between neighboring railing segments which conditions inserting post along a railing path.

## Syntax (C#)
```csharp
public double CornerPostAngle { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentException** - When setting this property: The given value for cornerPostAngle is not finite